tap "1password/tap"
tap "cockroachdb/tap"
tap "damascenorafael/tap"
tap "espanso/espanso"
tap "gitguardian/tap"
tap "hashicorp/tap"
tap "heroku/brew"

brew "amazon-ecs-cli"
brew "awscli"

brew "coreutils"
brew "fzf"
brew "eza"
brew "pwgen"
brew "watch"

brew "yt-dlp"
brew "xz"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "cffi"
brew "freetype"
brew "openjpeg"
brew "openssl"
brew "libffi"
brew "libmagic"
brew "libpq"
brew "libxmlsec1"
brew "libyaml"
brew "libavif"
brew "gnutls"
brew "graphicsmagick"
brew "zlib"
brew "imagemagick"

brew "gpg"
brew "pinentry-mac"

brew "curl"
brew "wget"
brew "deno"
brew "direnv"
brew "duckdb"
brew "git"
brew "difftastic"
brew "git-filter-repo"
brew "git-gui"
brew "graphviz"

brew "hey"
brew "htop"
brew "hugo"

brew "infracost"
brew "inframap"
brew "jq"
brew "mysql-client"
brew "neovim"
brew "neovide"
brew "fnm" # Faster alternative to nvm
brew "optipng"
brew "pandoc"
brew "pnpm"

brew "python@3.12"
brew "python@3.13"
brew "uv"
brew "pre-commit"
brew "virtualenv"
brew "pyenv"
brew "pygobject3"

brew "starship"

brew "terraform"
brew "terraform-docs"
brew "tflint"

brew "tmate"
brew "tmux"
brew "tree"

brew "heroku/brew/heroku"

cask "wkhtmltopdf"
cask "minecraft"
cask "arc"
cask "jordanbaird-ice"
cask "slack"
cask "1password"
cask "wezterm"
cask "appcleaner"
cask "barrier"
cask "chromedriver"
cask "dbeaver-community"
cask "discord"
cask "dropbox"
cask "easy-move-plus-resize"
cask "espanso"
cask "keycastr"  # for showing keystrokes
cask "loom"

cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-liberation-nerd-font"
cask "font-noto-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-space-mono-nerd-font"

cask "google-chrome"
cask "google-drive"

cask "hashicorp-vagrant"
cask "imageoptim"

cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"

cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "quicklook-csv"
cask "quicklook-json"

cask "raycast"
cask "reminders-menubar"
cask "spotify"
cask "sublime-text"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
cask "docker"
